Repository: andrewcy86/ari-adminer
Catalog: languages/ari-adminer-*.po
Languages: ru_ru

source: update PHP version on your server from v. %s to at least v. %s
ru_ru: PHP версии %s используется на Вашем сервере, обновите его минимум до версии %s

source: install PHP SPL extension
ru_ru: установите SPL расширение для PHP

source: update WordPress v. %s to at least v. %s
ru_ru: Вы используете WordPress версии %s, обновите его до версии %s или выше

source: "ARI Adminer" can not be activated. It requires PHP version 5.4.0+ with SPL extension and WordPress 4.0+.<br /><br /><b>Recommendations:</b> %s.<br /><br /><a href="%s" class="button button-primary">Back</a>
ru_ru: “ARI Adminer” не может быть установлен. Требуется PHP версии 5.4.0 или выше с установленным расширением SPL и WordPress версии 4.0 или выше.<br /><br /><b>Рекомендации:</b> %s.<br /><br /><a href="%s" class="button button-primary">Назад</a>

source: Run Adminer
ru_ru: Запустить Adminer

source: Connections
ru_ru: Подключения к БД

source: Settings
ru_ru: Настройки

source: You do not have permissions to run Adminer
ru_ru: У вас недостаточно прав для запуска Adminer

source: The selected connection is not available.
ru_ru: Выбранное подключение не доступно

source: Connection parameters are invalid.
ru_ru: Введены некорректные параметры подключения

source: The connection(s) deleted successfully
ru_ru: Подключения удалены успешно

source: The connection(s) can not be deleted
ru_ru: Подключения не могут быть удалены

source: The connection deleted successfully
ru_ru: Подключение было удалено

source: The connection can not be deleted
ru_ru: Подключение не может быть удалено

source: The connection is saved successfully
ru_ru: Параметры подключения к БД сохранены

source: No results found
ru_ru: Записей не найдено

source: Help
ru_ru: Помощь

source: User's guide is available <a href="%s" target="_blank">here</a>.
ru_ru: Руководство пользователя доступно <a href="%s" target="_blank">здесь</a>.

source: Adminer theme
ru_ru: Adminer тема

source: The selected theme will be used in Adminer application.
ru_ru: Выбранная тема будет использована в приложении Adminer

source: Mode
ru_ru: Режим работы

source: If "Advanced" mode is selected, "Adminer" application will be used. It full-featured application for database management. When "Simple" option is chosen, "Adminer Editor" will be used. It has limited functionality.
ru_ru: Если выбран “Продвинутый” режим, будет использоваться приложение Adminer. Это многофункциональное приложение для управления базами данных. Adminer Editor используется, если выбран “Простой” режим. Adminer Editor поддерживает меньше возможностей.

source: Stop "Adminer" on logout
ru_ru: Останавливать Adminer при выходе из WordPress

source: If the parameter is enabled, all "Adminer" sessions will be terminated when user is logged out from WordPress.
ru_ru: Используйте этот параметр, если хотите прервать все запущенные сессии текущим пользователем в Adminer при выходе из WordPress.

source: Roles
ru_ru: Роли пользователей

source: Only users with the selected user role will have access to the plugin.
ru_ru: Только пользователи с выбранными ролями будут иметь доступ к Adminer

source: Advanced
ru_ru: Продвинутый

source: Simple
ru_ru: Простой

source: Stop on logout
ru_ru: Прервать при выходе из WordPress

source: It is not possible to test connection. "%s" DB driver is not implemented.
ru_ru: Невозможно проверить подключение к БД. “%s” БД драйвер отсутствует.

source: Connection parameters are valid.
ru_ru: Введены корректные параметры подключения

source: Could not connect to DB. The following error occurs:
ru_ru: Не получилось подключиться к БД. Произошла следующая ошибка:

source: Share feedback or idea
ru_ru: Поделитесь идеей

source: Write a review and give a rating
ru_ru: Напишите отзыв

source: Follow us on Twitter
ru_ru: Присоединяйтесь в Twitter

source: DB Connection parameters
ru_ru: Параметры подключения к БД

source: Connection
ru_ru: Подключение

source: - Custom parameters -
ru_ru: - Ввести параметры -

source: - WordPress database -
ru_ru: - WordPress БД -

source: DB Type
ru_ru: Тип БД

source: Host
ru_ru: Имя сервера с БД

source: Eg. localhost
ru_ru: localhost

source: Path to DB file
ru_ru: Пусть к файлу БД

source: DB name
ru_ru: Имя БД

source: Specify database
ru_ru: Укажите БД

source: User
ru_ru: Пользователь

source: Password
ru_ru: Пароль

source: Test Connection
ru_ru: Проверить соединение

source: Run Adminer in modal window
ru_ru: Запустить Adminer в модальном окне

source: Run Adminer in a new window
ru_ru: Запустить Adminer в новом окне

source: Yes
ru_ru: Да

source: No
ru_ru: Нет

source: OK
ru_ru: ОК

source: Cancel
ru_ru: Отмена

source: Close
ru_ru: Закрыть

source: Do you want to delete the selected item?
ru_ru: Вы действительно хотите удалить выбранную запись?

source: Do you want to delete the selected items?
ru_ru: Вы действительно хотите удалить выбранные записи?

source: The connection could not be saved. Try again please.
ru_ru: Параметры подключения к БД не были сохранены. Попробуйте ещё раз.

source: The connection could not be tested. Try again please.
ru_ru: Не удалось проверить параметры подключения. Попробуйте ещё раз.

source: Select an action
ru_ru: Выберите действие

source: Select at least one item
ru_ru: Выберите хотя бы одну запись

source: Title
ru_ru: Название

source: Edit
ru_ru: Редактировать

source: Delete
ru_ru: Удалить

source: Show more details
ru_ru: Показать больше данных

source: Type
ru_ru: Тип

source: Add New
ru_ru: Добавить

source: Connection settings
ru_ru: Параметры подключения

source: Specify title
ru_ru: Введите название

source: Save
ru_ru: Сохранить

source: Select bulk action
ru_ru: Выберите массовое действие

source: - Bulk Actions -
ru_ru: - Действие -

source: Apply
ru_ru: Применить

source: ARI Adminer - Settings
ru_ru: ARI Adminer - Настройки

source: Save Changes
ru_ru: Сохранить изменения
